Vamos a empezar a explorar las bases de datos

In [53]:
pip install sqldf

Requirement already satisfied: sqldf in c:\users\andre\anaconda3\lib\site-packages (0.4.2)Note: you may need to restart the kernel to use updated packages.

# Tarea 1
A continuación se cargarán las bibliotecas que serán, muy probablemente, utilizadas.

In [54]:
#import sqlite3
import sqldf
import pandas as pd
from pylab import*
import numpy as np
import scipy.stats 
from scipy.special import gamma
import seaborn as sns
from scipy.stats import beta
from scipy.stats import spearmanr
import pandas as pd

Ahora procedemos a cargar cada una de las bases del enunciado, iniciando los primeros pasos exploratorios. De manera general, se aplicará el mismo procedimiento a cada base y después, dependiendo de los datos que cada una presente, se observarán algunos tratamientos distintos. El procedimiento default corresponde a sacar, con info(), un resumen general de los tipos de datos que manejan las bases. Además, con sqldf se validará que no haya id's repetido si es el caso.

In [55]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_externa.txt"
bd_ini_externa = pd.read_csv(bd, sep=" ")
bd_ini_externa.head()

    _id_  comp_externo1  comp_externo2  comp_externo3  comp_externo4
0  78213     260.869565      25.854639           56.0         -230.0
1  76457      40.579710       2.872738           62.0         -230.0
2  40666            NaN            NaN          119.0         -230.0
3   8329     349.275362      34.616490           94.0         -230.0
4  68389     276.811594      27.434645          125.0         -230.0

In [56]:
bd_ini_externa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   _id_           50000 non-null  int64
 1   comp_externo1  47831 non-null  float64
 2   comp_externo2  44410 non-null  float64
 3   comp_externo3  49994 non-null  float64
 4   comp_externo4  50000 non-null  float64
dtypes: float64(4), int64(1)
memory usage: 1.9 MB

In [57]:
query ="""
       select distinct(_id_) as id
       from bd_ini_externa       
       """
len(sqldf.run(query))

50000

In [58]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_interna.csv"
bd_ini_interna = pd.read_csv(bd)
bd_ini_interna.head()

,_id_,fecha_inicio,comp_interno1,comp_interno2,comp_interno3,comp_interno4,categoria1,categoria2,categoria3
0,78213,2020-03-25,0.000000,b'0',11.0,58.0,2.0,9.0,156.0
1,76457,2020-02-13,0.000000,b'1',28.0,45.0,1.0,4.0,173.0
2,40666,2018-01-24,0.000000,b'1',25.0,45.0,1.0,9.0,170.0
3,8329,2016-10-07,0.000000,b'1',14.0,59.0,3.0,3.0,159.0
4,68389,2019-07-30,2026.342452,b'1',1.0,67.0,2.0,9.0,146.0

In [21]:
bd_ini_interna.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   _id_           50000 non-null  int64
 1   fecha_inicio   50000 non-null  object
 2   comp_interno1  50000 non-null  float64
 3   comp_interno2  50000 non-null  object
 4   comp_interno3  50000 non-null  float64
 5   comp_interno4  50000 non-null  float64
 6   categoria1     50000 non-null  float64
 7   categoria2     50000 non-null  float64
 8   categoria3     50000 non-null  float64
dtypes: float64(6), int64(1), object(2)
memory usage: 3.4+ MB

In [59]:
query ="""
       select distinct(_id_) as id
       from bd_ini_interna       
       """
len(sqldf.run(query))

50000

In [60]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_parte1.csv"
bd_ini_parte1 = pd.read_csv(bd)
bd_ini_parte1.head()

    _id_    _id2_  comp_mixto1
0  78213  1798899      0.33522
1  76457  1758511      0.33334
2  40666   935318      0.29186
3   8329   191567      0.29112
4  68389  1572947      0.27318

In [61]:
bd_ini_parte1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id_         50000 non-null  int64
 1   _id2_        50000 non-null  int64
 2   comp_mixto1  50000 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 1.1 MB

In [62]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_comportamiento_2.txt"
bd_comportamiento_2 = pd.read_csv(bd,sep=" ",low_memory=False)
bd_comportamiento_2.tail()
#categoria2, o 1 comportamiento de los clientes.

         num_caso      mes_informacion  Tiempo_aparicion
1455531     98990  2021-05-01 00:00:00               1.0
1455532     98992  2021-04-01 00:00:00               0.0
1455533     98992  2021-05-01 00:00:00               1.0
1455534     98997  2021-04-01 00:00:00               0.0
1455535     98997  2021-05-01 00:00:00               1.0

In [63]:
bd_comportamiento_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1455536 entries, 0 to 1455535
Data columns (total 3 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   num_caso          1455536 non-null  int64
 1   mes_informacion   1455536 non-null  object
 2   Tiempo_aparicion  1455536 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.3+ MB

In [73]:
query ="""
       select distinct(num_caso) as id
       from bd_comportamiento_2       
       """
len(sqldf.run(query))

49352

Por ejemplo, esta base (bd_comportamiento_2) tiene un comportamiento peculiar. Parece ser que, en resumen, registra el tiempo desde que un caso (id) empieza un trámite. Sin embargo, existe una duda: ¿qué pasa si un caso inicia otro procedimiento en algún momento dado? ¿se vuelve a comenzar desde cero? La siguiente consulta está pensada para que nos dé esa información, además, en el proceso, se logra que sólo aparezcan los valores únicos de los números de casos:

In [66]:
query ="""
       select num_caso,count(num_caso),max(Tiempo_aparicion) 
       from bd_comportamiento_2 group by num_caso       
       """
sqldf.run(query).head()

   num_caso  count(num_caso)  max(Tiempo_aparicion)
0         1               62                   61.0
1         7               29                   28.0
2         8               63                   51.0
3         9               15                   14.0
4        10               16                   15.0

La consulta indica que el máximo registro del tiempo no siempre es lo mismo que la cantidad de registros que tiene un caso dado (salvo por un número que se agrega por el cero) que es lo que se esperaría. Esto es un indicativo de que , en efecto, la base puede iniciar el registro de un mismo caso más adelante en el tiempo. La siguiente consulta dice cuántas veces un caso inició un proceso:

In [71]:
query ="""
       select num_caso,count(Tiempo_aparicion) as cantidad_tramites 
       from bd_comportamiento_2 where Tiempo_aparicion=0 group by num_caso,Tiempo_aparicion        
       """
sqldf.run(query).head(20)

    num_caso  cantidad_tramites
0          1                  1
1          7                  1
2          8                  5
3          9                  1
4         10                  1
5         14                  1
6         18                  1
7         21                  1
8         22                  1
9         24                  1
10        25                  1
11        27                  1
12        28                  1
13        29                  1
14        31                  1
15        32                  2
16        34                  1
17        35                  1
18        36                  1
19        41                  1

In [74]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_comportamiento_3.csv"
bd_comportamiento_3 = pd.read_csv(bd,low_memory=False)
bd_comportamiento_3.head()

   num_caso      mes_informacion  comportamiento_j
0         1  2016-04-01 00:00:00               0.0
1         1  2016-05-01 00:00:00               0.0
2         1  2016-06-01 00:00:00               0.0
3         1  2016-07-01 00:00:00               0.0
4         1  2016-08-01 00:00:00               0.0

In [24]:
bd_comportamiento_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1455536 entries, 0 to 1455535
Data columns (total 3 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   num_caso          1455536 non-null  int64
 1   mes_informacion   1455536 non-null  object
 2   comportamiento_j  1455536 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.3+ MB

In [76]:
query ="""
       select distinct(num_caso) as id
       from bd_comportamiento_3      
       """
len(sqldf.run(query))

49352

In [75]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_inversion.txt"
bd_base_inversion= pd.read_csv(bd,sep=" ")
bd_base_inversion.head()

     _id2_  inversion
0  1758511   0.041039
1  1572947  77.422135
2  1051836  90.539953
3  1223255  90.205018
4  1894602   1.071354

In [25]:
bd_base_inversion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17536 entries, 0 to 17535
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   _id2_      17536 non-null  int64
 1   inversion  17536 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 274.1 KB

In [77]:
query ="""
       select distinct(_id2_)
       from bd_base_inversion      
       """
len(sqldf.run(query))

17536

In [15]:
direction= ruta="C:/Users/andre/Desktop/Daniel .v/Semestre 2022-1/Seminario Estadística I"
bd="base_ini_parte1.csv"
bd_ini_parte1= pd.read_csv(bd)
bd_ini_parte1.head()

    _id_    _id2_  comp_mixto1
0  78213  1798899      0.33522
1  76457  1758511      0.33334
2  40666   935318      0.29186
3   8329   191567      0.29112
4  68389  1572947      0.27318

In [26]:
bd_ini_parte1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   _id_         50000 non-null  int64
 1   _id2_        50000 non-null  int64
 2   comp_mixto1  50000 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 1.1 MB

In [78]:
query ="""
       select distinct(_id_) as id
       from bd_ini_parte1      
       """
len(sqldf.run(query))

50000

In [79]:
query ="""
       select distinct(_id2_) as id
       from bd_ini_parte1      
       """
len(sqldf.run(query))

50000